src/InformationRegisters/ИсторияОтправкиПисемПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОтправкиПисемПоставщикам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КопияАдресМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>51</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРегистрации</Name>
					<Comment>для документов, которые отправляются дважды</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияОтправкиПисемПоставщикам/Ext/ManagerModule.bsl
Процедура ДобавитьКРассылкеПроизвольноеПисьмо(ТемаПисьма,ТекстПисьма,ОбъектРассылки = Неопределено ,Получатели = "", Ответственный = Неопределено) Экспорт

	Если Ответственный = неопределено Тогда
	    Ответственный = ПараметрыСеанса.ТекущийПользователь
	КонецЕсли;
	Если ОбъектРассылки = Неопределено  Тогда
	     ОбъектРассылки = СокрЛП(Новый УникальныйИдентификатор);
	 КонецЕсли;
	 
	НовоеПисьмо = РегистрыСведений.ИсторияОтправкиПисемПоставщикам.СоздатьМенеджерЗаписи();
	
	НовоеПисьмо.ДатаРегистрации = ТекущаяДата();
	НовоеПисьмо.Ответственный = Ответственный;
	НовоеПисьмо.Отправлен = Ложь;
	НовоеПисьмо.Ошибка = Ложь;
	НовоеПисьмо.Объект = ОбъектРассылки;
	НовоеПисьмо.АдресПоставщика = Получатели;
	НовоеПисьмо.ОтправленныеДанные = новый ХранилищеЗначения(новый Структура("ТемаПисьма,ТекстПисьма",ТемаПисьма,ТекстПисьма));
	НовоеПисьмо.Записать(Истина);	
	
КонецПроцедуры
